app/controllers/juegos_controller.rb

  def index
    @juegos = Juego.all
---
SELECT "juegos".* FROM "juegos"

  def create
    @juego = Juego.new(juego_params)

    respond_to do |format|
      if @juego.save
---
INSERT INTO "juegos" ("nombre", "descripcion", "categoria", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "Metal gear solid"], ["descripcion", "un guarro"], ["categoria", "Shooter"], ["created_at", "2023-10-22 20:42:37.756927"], ["updated_at", "2023-10-22 20:42:37.756927"]]

  def update
    respond_to do |format|
      if @juego.update(juego_params)
---
UPDATE "juegos" SET "descripcion" = ?, "updated_at" = ? WHERE "juegos"."id" = ?  [["descripcion", "un guarro muy guarro"], ["updated_at", "2023-10-22 20:42:53.917145"], ["id", 1]]

    def set_juego
      @juego = Juego.find(params[:id])
---
SELECT "juegos".* FROM "juegos" WHERE "juegos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]